n = int(input('Введите трёхзначное число: '))
print(n%10 + n//100 + n//10%10) 

s = int(input('Введите общее количество журавликов: '))
m = k = s//6
n = 2 * (s//6 + s//6)
print (m, n, k)

b = int (input ("Введите номер билетика: "))
m = b//1000
n = b%1000
if m//100 + m//10%10 + m%10 == n//100 + n//10%10 + n%10:
    print ('yes')
else:
    print ('no')    


m = int(input('Введите кол-во долек в длину: '))
n = int(input('Веедите кол-во долек в ширину: '))
k = int(input('Введите кол-во долек, которые нужно отломить: '))
if k%m == 0 or k%n == 0:
    print('yes')
else:
    print('no')    